<a href="https://colab.research.google.com/github/Daehyun-Bigbread/Bigbread_DB_2023_2/blob/main/%E2%80%8D%EA%B9%80%EB%8C%80%ED%98%84%5B%EC%9E%AC%ED%95%99_%EC%BB%B4%ED%93%A8%ED%84%B0_%EC%A0%84%EC%9E%90%EC%8B%9C%EC%8A%A4%ED%85%9C%EA%B3%B5%ED%95%99%EC%A0%84%EA%B3%B5%5D_ch6_homework_2023_dbc_student.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - SQL2

1. Use Google Colabortory and do your homework.
3. (In Google colaboratory) Before you submit your homework, restart kernel and run every cell!
4. Save (File->Save) the file
5. Submit your homework (this file) in Google classroom
6. **Don't forget to click "제출" button** ("Submit", "완료로 표시", 또는 "제출" 버턴을 누르지 않으면 제출된 것이 아님)
7. No late homeworks will be accepted for any reason!

To edit this cell, double click here
```
이름:김대현
학번:202000449
학과:컴퓨터전자시스템공학부
제출일:23.11.30
```

- 권고사항: 모든 SQL select 문에 tuple variable를 사용할 것.

- SQL 작성시, 문제에 주어지지 않은 상수를 사용하는 경우 (cheating), **마이너스 점수**를 받는다.

- **점수: 각 10점, 19번 20점, 총200점**

In [1]:
%load_ext sql

In [2]:
!pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.2.0.tar.gz (89 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 89.5/89.5 kB 1.9 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.0-cp310-cp310-linux_x86_64.whl size=123670 sha256=b7d67a6e57649fbdd08f16cd74482a422dba0f32c33848fe7a517a603d3a166b
  Stored in directory: /root/.cache/pip/wheels/a4/f8/fd/0399687c0abd03c10c975ed56c692fcd3d0fb80440b5a661f1
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.0

### Use your host, id, password, and database

In [3]:
import getpass
user = 's202000449'
password = getpass.getpass()
host='dm.hufs.ac.kr'
database = 's202000449db'
connection_string = f'mysql://{user}:{password}@{host}:3306/{database}'

%sql $connection_string

··········

In [4]:
%sql show databases;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
2 rows affected.

[('information_schema',), ('s202000449db',)]

In [5]:
%sql use s202000449db;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [6]:
%sql show tables;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
17 rows affected.

[('COURSE',),
 ('DEPARTMENT',),
 ('DEPENDENT',),
 ('DEPT_LOCATIONS',),
 ('EMPLOYEE',),
 ('GRADE_REPORT',),
 ('MAJOR_GRADE_REPORT',),
 ('PREREQUISITE',),
 ('PROJECT',),
 ('SECTION',),
 ('STUDENT',),
 ('WORKS_ON',),
 ('WORKS_ON1',),
 ('bssn',),
 ('dept',),
 ('emp',),
 ('salary_audit',)]

## Warning: Your companydb state MUST be clean as initial state

- Refer to jupyter notebook on "SQL Lab"

### When you list the name of employees, the name must be the following format:

- Output Schema and tuple format:

```
+------------------+
| Employee name    |
+------------------+
| John B. Smith    |
...
+------------------+
```

- Use MySQL concat 함수 사용, Refer to MySQL manual or  Googling

### 1-14번에 대해 SQL select 문을 작성하고 MySQL에서 실행한 결과물을 제출하시오.

#### 1. Retrieve the names of employees in department 5 who work more than 10 hours per week on the 'ProductX' project. (single SELECT 사용, MySQL concat 함수 사용)

kor: 1.'ProductX' 프로젝트에서 주당 10시간 이상 근무하는 5번 부서 직원의 이름을 검색합니다.

In [7]:
%%sql

select concat(e.Fname, ' ', e.Lname) as Employee_Name # 직원의 전체 이름(성, 이름) 결합
from EMPLOYEE e
join WORKS_ON w on e.Ssn = w.Essn # WORKS_ON 테이블, EMPLOYEE 테이블 연결, 직원이 어떤 프로젝트에서 일하는지?
join PROJECT p on w.Pno = p.Pnumber # PROJECT 테이블, WORKS_ON 테이블 연결, 프로젝트 번호 파악

# 부서번호가 5, ProductX에 참여하는 직원중 일한 Hours가 10시간 이상?
where e.Dno = 5 and p.Pname = 'ProductX' and w.Hours > 10;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
2 rows affected.

[('John Smith',), ('Joyce English',)]


#### 2.  List the names of employees who have a dependent with the same sex as themselves. (EXISTS 사용)
kor: 자신과 성별이 같은 부양가족이 있는 직원의 이름을 나열합니다. (EXISTS 사용)

In [8]:
%%sql

select concat(e.Fname, ' ', e.Lname) as Employee_Name # 직원의 전체 이름(성, 이름) 결합
from EMPLOYEE e
where exists (
  select *
  from DEPENDENT d # DEPENDENT 테이블 (부양가족 테이블에서)
  where e.ssn = d.Essn and e.Sex = d.sex # EMPLOYEE, DEPENDENT 테이블 직원 번호가 같고, 직원, 부양가족의 성별이 같아?
)

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
2 rows affected.

[('John Smith',), ('Franklin Wong',)]

#### 3.  Find the names of employees that are directly supervised by 'Franklin Wong'. (EXISTS 사용)
kor: Franklin Wong'이 직접 감독하는 직원의 이름을 찾습니다. (EXISTS 사용)

In [9]:
%%sql

select concat(e1.Fname, ' ', e1.Lname) as Employee_Name # 직원의 전체 이름(성, 이름) 결합
from EMPLOYEE e1 # 감독하는 직원
where exists (
  select *
  from EMPLOYEE e2 # Franklin Wong
  where e2.Fname = 'Franklin' and e2.Lname = 'Wong' and e1.Superssn = e2.Ssn #  Franklin Wong의 ssn과 직원들의 superssn이 같으면 감독
)

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
3 rows affected.

[('John Smith',), ('Joyce English',), ('Ramesh Narayan',)]

#### 4.  For each project, list the project name and the total hours per week (by all employees) spent on that project.
kor: 각 프로젝트에 대해 프로젝트 이름과 해당 프로젝트에 소요된 주당 총 시간(모든 직원)을 나열합니다.

Output Schema:
```
+-----------------+-------------+
| Project name    | Total hours |
+-----------------+-------------+
```

In [11]:
%%sql

select p.Pname as 'Project name', sum(w.Hours) as 'Total hours' # 프로젝트 이름과 프로젝트에 소요된 총 시간
from PROJECT p
join WORKS_ON w on p.Pnumber = w.Pno # WORKS_ON, PROJECT 테이블 조인, 작업시간을 가져옴

# 프로젝트의 이름을 그룹화
group by p.Pname;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
6 rows affected.

[('Computerization', Decimal('55.0')),
 ('Newbenefits', Decimal('55.0')),
 ('ProductX', Decimal('52.5')),
 ('ProductY', Decimal('37.5')),
 ('ProductZ', Decimal('50.0')),
 ('Reorganization', Decimal('25.0'))]

#### 5.  Retrieve the names of employees who work on every project managed by 'Administration' department.
kor: '관리' 부서에서 관리하는 모든 프로젝트에서 일하는 직원의 이름을 검색합니다.

In [12]:
%%sql

select p.Pname as 'Project name', concat(e.Fname, ' ', e.Lname) as 'Employee_Name'
from EMPLOYEE e
join WORKS_ON w on e.Ssn = w.Essn # 어떤 직원이 어떤 프로젝트에 일하는지?
join PROJECT p on w.Pno = p.Pnumber # 각 작업이 어떤 프로젝트에 속하는지?
join DEPARTMENT d on p.Dnum = d.Dnumber # 각 프로젝트가 어떤 부서에서 관리되는지?

# Administration 부서가 관리하는 프로젝트에 참여하는 직원만 찾음
where d.Dname = 'Administration' and not exists (
  select p2.Pnumber
  from PROJECT p2
  join DEPARTMENT d2 on p2.Dnum = d2.Dnumber
  # 현재 직원이 특정 프로젝트에서 일하는지 확인
  where d2.Dname = 'Administration' and not exists (
    select *
    from WORKS_ON w2
    where w2.Essn = e.Ssn and w2.Pno = p2.Pnumber
  )
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
4 rows affected.

[('Computerization', 'Ahmad Jabbar'),
 ('Computerization', 'Alicia Zelaya'),
 ('Newbenefits', 'Ahmad Jabbar'),
 ('Newbenefits', 'Alicia Zelaya')]

#### 6.  Retrieve the names of employees who do not work on any project which is located in 'Houston'. (NOT EXISTS 사용)
kor: '휴스턴'에 위치한 프로젝트에서 작업하지 않는 직원의 이름을 검색합니다(존재하지 않음 사용)

In [13]:
%%sql

select p.Pname as 'Project name', concat(e.Fname, ' ', e.Lname) as 'Employee_Name'
from EMPLOYEE e
join WORKS_ON w on e.Ssn = w.Essn # 어떤 직원이 어떤 프로젝트에 일하는지?
join PROJECT p on w.Pno = p.Pnumber # 각 작업이 어떤 프로젝트에 속하는지?

# 'Houston'에 위치한 프로젝트에 참여하는 직원을 제외
where not exists (
  # 'Houston'에 위치한 프로젝트를 찾음
  select *
  from WORKS_ON w2
  join PROJECT p2 on w2.Pno = p2.Pnumber
  where w2.Essn = e.Ssn and p2.Plocation = 'Houston'
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
8 rows affected.

[('Computerization', 'Ahmad Jabbar'),
 ('Computerization', 'Alicia Zelaya'),
 ('Newbenefits', 'Ahmad Jabbar'),
 ('Newbenefits', 'Alicia Zelaya'),
 ('ProductX', 'John Smith'),
 ('ProductX', 'Joyce English'),
 ('ProductY', 'John Smith'),
 ('ProductY', 'Joyce English')]

#### 7.  For each department, retrieve the department name, and the average salary of employees working in that department.(소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)

kor: 7. 각 부서별로 부서명 및 해당 부서에서 근무하는 직원의 평균 급여를 검색한다. (소수점 이하 2 자리까지만(버림) 출력, MySQL 매뉴얼 또는 구글링 참조)

Output schema
```
+-----------------+----------------+
| Department name | Average salary |
+-----------------+----------------+
```

In [15]:
%%sql

# 각 부서의 이름, 해당 부서에서 일하는 직원들의 평균 급여 선택. (소수점 이하 두 자리 버림)
select d.Dname as 'Department name', round(avg(e.Salary), 2) as 'Average salary'
from DEPARTMENT d
# DEPARTMENT와 EMPLOYEE 테이블을 조인, 각 부서의 직원 정보를 얻음.
join EMPLOYEE e on d.Dnumber = e.Dno
# 결과를 부서별로 그룹화
group by d.Dname;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
3 rows affected.

[('Administration', Decimal('31000.00')),
 ('Headquarters', Decimal('55000.00')),
 ('Research', Decimal('38087.50'))]

#### 8.  Retrieve the average salary of all female employees. (소수점 이하 2자리까지만(버림) 출력, Refer to MySQL manual or  Googling)

kor: 8. 전체 여직원 평균 급여 회수 (소수점 이하2 자리까지만(버림) 출력, MySQL 매뉴얼 또는 구글링 참조)

Output Schema:
```
+----------------+
| Average salary |
+----------------+
```

In [18]:
%%sql

# 여성 직원들의 평균 급여를 소수점 이하 두 자리까지 버림하여 선택
select ROUND(AVG(e.Salary), 2) as 'Average salary'
from EMPLOYEE e
# 성별이 여성인 직원들을 필터링
where Sex = 'F';

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
1 rows affected.

[(Decimal('32750.00'),)]

#### 9.  Find the names and addresses of employees who work on at least one project located in Houston but whose department has no location in Houston. (EXISTS, NOT EXISTS 사용)

kor: 9. Houston에 위치하지만 부서가 Houston에 위치하지 않은 직원의 이름과 주소를 찾습니다. (존재하지 않음 사용)


Output schema:

```
+---------------------+-------------------------+
| Employee name       | Address                 |
+---------------------+-------------------------+
```

In [20]:
%%sql

# Houston에 위치한 적어도 하나의 프로젝트, 부서의 위치가 Houston이 아닌 직원들의 이름과 주소를 선택
select concat(e.Fname, ' ', e.Lname) as 'Employee name', e.Address
from EMPLOYEE e

# Houston에 위치한 프로젝트에서 일하는 직원을 찾기 위해 exists 사용
where exists (
    select *
    from WORKS_ON w
    join PROJECT p on w.Pno = p.Pnumber
    where w.Essn = e.Ssn and p.Plocation = 'Houston'
)

# 해당 직원 부서가 Houston에 없음을 확인하기 위해 not exists 사용
and not exists (
    select *
    from DEPT_LOCATIONS dl
    join DEPARTMENT d on dl.Dnumber = d.Dnumber
    where d.Dnumber = e.Dno and dl.Dlocation = 'Houston'
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
1 rows affected.

[('Jennifer Wallace', '291-Berry-Bellaire-TX')]

#### 10.  List the names of department managers who have no dependents. (EXISTS, NOT EXISTS 사용)

kor: 종속자가 없는 부서 관리자의 이름을 나열합니다(존재, 존재하지 않음 사용)

In [22]:
%%sql

# superssn 중 의존자가 없는 사람들의 이름을 선택
select concat(e.Fname, ' ', e.Lname) as 'Manager name'
from EMPLOYEE e

# DEPARTMENT 테이블을 사용하여 superssn을 식별
join DEPARTMENT d1 on e.Ssn = d1.Mgrssn

# 해당 superssn이 의존자를 가지고 있지 않음을 확인하기 위해 not exists 사용
where not exists (
    select *
    from DEPENDENT d2
    where d2.Essn = e.Ssn
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
1 rows affected.

[('James Borg',)]

#### 11. Retrieve the names of all employees who work in the department that has the employee with the highest salary among all employees.

kor: 전체 직원 중 급여가 가장 높은 직원이 있는 부서에서 근무하는 모든 직원의 이름을 검색

In [28]:
%%sql

# 가장 높은 급여를 받는 직원이 속한 부서에서 일하는 모든 직원들의 이름을 찾음
select concat(e1.Fname, ' ', e1.Lname) as 'Employee name'
from EMPLOYEE e1

# 가장 높은 급여를 받는 직원의 부서 번호를 찾음
where e1.Dno = (
    select e2.Dno
    from EMPLOYEE e2
    # 급여를 내림차순으로 정렬, 가장 높은 급여를 받는 직원의 부서 번호만 반환
    order by e2.Salary desc
    limit 1
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
1 rows affected.

[('James Borg',)]

#### 12. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (EXISTS 안에 EXISTS 사용)

kor: 감독관의 감독관이 James Borg인 모든 직원의 이름 검색(EXISTS 안에 EXISS 사용)

In [30]:
%%sql

# James Borg가 상사 <- 상사인 모든 직원들의 이름을 찾음
select concat(e1.Fname, ' ', e1.Lname) as 'Employee name'
from EMPLOYEE e1
where exists (
    # e1의 상사를 찾아라
    select *
    from EMPLOYEE e2
    where e1.Superssn = e2.Ssn and exists (
        # e2의 상사가 James Borg 인지 확인
        select *
        from EMPLOYEE e3
        where e2.Superssn = e3.Ssn and e3.Fname = 'James' and e3.Lname = 'Borg'
    )
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
5 rows affected.

[('John Smith',),
 ('Joyce English',),
 ('Ramesh Narayan',),
 ('Ahmad Jabbar',),
 ('Alicia Zelaya',)]

#### 13. Retrieve the names of all employees whose supervisor’s supervisor is James Borg. (single SELECT 사용)

kor: 감독관의 감독관이 James Borg인 모든 직원의 이름 검색(단일 SELECT 사용)

In [32]:
%%sql

# James Borg가 상사 <- 상사인 모든 직원들의 이름을 찾음 (단일 select)
select concat(e1.Fname, ' ', e1.Lname) as 'Employee name'
from EMPLOYEE e1

# 첫 번째 JOIN: 각 직원(e1)의 직접 상사(e2)를 찾기 위해 EMPLOYEE를 자기 자신과 조인
join EMPLOYEE e2 on e1.Superssn = e2.Ssn

# 두 번째 JOIN: e1의 상사(e2)의 상사(e3)를 찾기 위해 EMPLOYEE 테이블을 다시 조인
join EMPLOYEE e3 on e2.Superssn = e3.Ssn

# WHERE은 e3가 James Borg인 경우만 필터링
where e3.Fname = 'James' and e3.Lname = 'Borg';

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
5 rows affected.

[('John Smith',),
 ('Joyce English',),
 ('Ramesh Narayan',),
 ('Ahmad Jabbar',),
 ('Alicia Zelaya',)]

#### 14. Retrieve the names of employees who make at least 10,000 dollars more than the employee who is paid the least in the company.

kor: 회사에서 월급을 가장 적게 받는 직원보다 1만 달러 이상 버는 직원의 이름을 검색합니다.

In [35]:
%%sql

# 회사에서 가장 낮은 급여를 받는 직원보다 적어도 10,000달러 이상 많은 급여를 받는 직원들의 이름을 찾음
select concat(e1.Fname, ' ', e1.Lname) as 'Employee name'
from EMPLOYEE e1
where e1.Salary > (
    # 회사에서 가장 낮은 급여를 찾는 서브쿼리
    select MIN(e2.Salary)
    from EMPLOYEE e2
) + 10000;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
5 rows affected.

[('John Smith',),
 ('Franklin Wong',),
 ('Ramesh Narayan',),
 ('James Borg',),
 ('Jennifer Wallace',)]

### 15-18번에 대해 SQL view문을 작성하고 MySQL에서 “select * from <view_name>”을 실행한 결과물을 제출하시오.

#### 15. A view that has the department name, manager name, and manager salary for every department

kor: 각 부서의 부서 이름, 관리자 이름 및 관리자 급여가 있는 보기

In [40]:
%%sql

# DEPT_VIEW 라는 이름의 뷰를 생성 -> 각 부서의 이름, 관리자 이름, 그리고 관리자 급여를 포함
create view DEPT_VIEW as

# 각 부서의 이름을 선택
select d.Dname as 'Department Name',
       concat(m.Fname, ' ', m.Lname) as 'Manager Name',
       # 관리자의 급여를 선택
       m.Salary as 'Manager Salary'
from DEPARTMENT d

# DEPARTMENT 테이블과 EMPLOYEE 테이블을 조인.
# 조인은 DEPARTMENT 테이블, Mgrssn와 EMPLOYEE 테이블의 Ssn을 기준
join EMPLOYEE m on d.Mgrssn = m.Ssn;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
(MySQLdb.OperationalError) (1050, "Table 'DEPT_VIEW' already exists")
[SQL: # DEPT_VIEW 라는 이름의 뷰를 생성 -> 각 부서의 이름, 관리자 이름, 그리고 관리자 급여를 포함
create view DEPT_VIEW as

# 각 부서의 이름을 선택
select d.Dname as 'Department Name',
       concat(m.Fname, ' ', m.Lname) as 'Manager Name',
       # 관리자의 급여를 선택
       m.Salary as 'Manager Salary'
from DEPARTMENT d

# DEPARTMENT 테이블과 EMPLOYEE 테이블을 조인.
# 조인은 DEPARTMENT 테이블, Mgrssn와 EMPLOYEE 테이블의 Ssn을 기준
join EMPLOYEE m on d.Mgrssn = m.Ssn;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [41]:
%sql select * from DEPT_VIEW;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
3 rows affected.

[('Headquarters', 'James Borg', Decimal('55000.00')),
 ('Administration', 'Jennifer Wallace', Decimal('43000.00')),
 ('Research', 'Franklin Wong', Decimal('44000.00'))]

#### 16. A view that has the employee name, supervisor name, and employee salary for each employee who works in the ‘Research’ department

kor: '리서치' 부서에 근무하는 각 직원의 직원 이름, 감독자 이름 및 직원 급여가 있는 보기

In [42]:
%%sql

# 'Research' 부서에서 일하는 직원의 이름, 상사 이름, 그리고 급여를 포함하는 뷰를 생성
create view RESEARCH_DEPT_VIEW as

# 직원의 이름을 첫, 마지막 이름을 합쳐서 생성
select concat(e.Fname, ' ', e.Lname) as 'Employee Name',
       # 해당 직원의 상사의 이름을 첫, 마지막 이름을 합쳐서 생성
       concat(m.Fname, ' ', m.Lname) as 'Supervisor Name',
       # 직원의 급여를 선택
       e.Salary

# EMPLOYEE 테이블을 사용하여 직원 정보를 가져옴
from EMPLOYEE e
# EMPLOYEE 테이블을 자기 자신과 조인하여, 각 직원의 상사 정보를가져옴
join EMPLOYEE m on e.Superssn = m.Ssn
# DEPARTMENT 테이블을 조인하여 부서 정보를 가져옴
join DEPARTMENT d on e.Dno = d.Dnumber
# 'Research' 부서에서 일하는 직원만을 필터링
where d.Dname = 'Research';

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [43]:
%sql select * from RESEARCH_DEPT_VIEW;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
4 rows affected.

[('John Smith', 'Franklin Wong', Decimal('36300.00')),
 ('Franklin Wong', 'James Borg', Decimal('44000.00')),
 ('Joyce English', 'Franklin Wong', Decimal('30250.00')),
 ('Ramesh Narayan', 'Franklin Wong', Decimal('41800.00'))]

#### 17. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project

kor: 프로젝트 이름, 제어 부서 이름, 직원 수 및 각 프로젝트에 대해 주당 작업한 총 시간이 있는 보기

In [44]:
%%sql

# 프로젝트 이름, 관리 부서 이름, 프로젝트에 참여 직원 수, 프로젝트에서 일하는 총 시간 포함하는 뷰 생성
create view PROJECT_VIEW as
select p.Pname as 'Project Name',
       d.Dname as 'Department Name',
       # 프로젝트 참여하는 직원 수를 카운트
       count(e.Ssn) as 'Number of Employees',
       # 프로젝트에서 일하는 총 시간을 계산
       sum(w.Hours) as 'Total Hours Worked Per Week'

from PROJECT p
# PROJECT, DEPARTMENT 테이블을 조인, 각 프로젝트의 관리 부서 정보 가져옴
join DEPARTMENT d on p.Dnum = d.Dnumber

# WORKS_ON 테이블 조인, 프로젝트에 참여하는 직원들의 작업 시간 정보 가져옴
join WORKS_ON w on p.Pnumber = w.Pno

# EMPLOYEE 테이블 조인, 프로젝트에 참여하는 직원들의 정보를 가져옴
join EMPLOYEE e on w.Essn = e.Ssn

# 프로젝트별로 그룹화
group by p.Pname, d.Dname;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [45]:
%sql select * from PROJECT_VIEW;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
6 rows affected.

[('ProductX', 'Research', 2, Decimal('52.5')),
 ('ProductY', 'Research', 3, Decimal('37.5')),
 ('ProductZ', 'Research', 2, Decimal('50.0')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 18. A view that has the project name, controlling department name, number of employees, and total hours worked per week on the project for each project with more than two employees working on it

kor: 프로젝트 이름, 제어 부서 이름, 직원 수, 총 작업 시간을 각 프로젝트에 대해 작업한 직원 수가 2명 이상인 보기

In [46]:
%%sql

# 2명 이상 직원이 참여하는 프로젝트의 이름, 관리 부서 이름, 직원 수, 그리고 주당 작업 시간 포함 뷰 생성
create view PROJECT_VIEW_GT2 as

# 각 프로젝트의 이름을 선택
select p.Pname as 'Project Name',
       # 해당 프로젝트 관리하는 부서의 이름을 선택
       d.Dname as 'Department Name',
       # 해당 프로젝트 참여하는 직원 수를 카운트
       count(e.Ssn) as 'Number of Employees',
       # 해당 프로젝트에 일하는 총 시간을 합산
       sum(w.Hours) as 'Total Hours Worked Per Week'

# PROJECT 테이블 -> 프로젝트 정보를 가져옴
from PROJECT p
# DEPARTMENT 테이블 조인, 각 프로젝트의 관리 부서 정보를 가져옴
join DEPARTMENT d on p.Dnum = d.Dnumber
# WORKS_ON 테이블을 조인, 프로젝트에 참여하는 직원들의 작업 시간 정보를 가져옴
join WORKS_ON w on p.Pnumber = w.Pno
# EMPLOYEE 테이블을 조인, 프로젝트에 참여하는 직원들의 정보를 가져옴
join EMPLOYEE e on w.Essn = e.Ssn
# 결과를 프로젝트별로 그룹화
group by p.Pname, d.Dname
# HAVING 절을 사용, 2명 이상의 직원이 참여하는 프로젝트 필터링
having count(e.Ssn) > 2;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [47]:
%sql select * from PROJECT_VIEW_GT2;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
4 rows affected.

[('ProductY', 'Research', 3, Decimal('37.5')),
 ('Computerization', 'Administration', 3, Decimal('55.0')),
 ('Reorganization', 'Headquarters', 3, Decimal('25.0')),
 ('Newbenefits', 'Administration', 3, Decimal('55.0'))]

#### 19. EMPLOYEE 테이블의 salary의 변경사항이 있을 때 마다, 변경사항을 기록하는 테이블 salary_audit(ssn, before_salary, after_salary, u_datetime)을 만들고, update trigger를 사용하여 변경사항을 기록하시오. 5번 부서에 속하는 직원의 salary를 100% 상향 조정 후, “select * from salary_audit”를 통해 결과를 확인하시오. udatetime에는 수정이 실행된 DATETIME(SQL Datatype, 날짜와 시각)을 기록한다. 현재 시각값은 now() 함수를 통해 얻을 수 있다.

## Warning
- 19번 문제 Update 한 후에 1-18번 문제를 다시 풀면 다른 결과가 나올 수 있음
- 1-18번 문제는 반드시 companydb의 초기 상태에서 풀어야 함

In [49]:
%%sql

# 존재하는 salary_audit 테이블을 삭제
drop table if exists salary_audit;

# salary_audit 테이블을 생성 ->  테이블은 직원의 급여 변경사항 기록
create table salary_audit (
    # 직원 ssn 번호
    ssn char(9),
    # 변경전 급여
    before_salary decimal(10, 2),
    # 변경후 급여
    after_salary decimal(10, 2),
    # 수정된 날짜, 시간
    u_datetime DATETIME
);

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.
0 rows affected.

[]

In [52]:
%%sql

# EMPLOYEE 테이블의 salary가 변경시 실행될 트리거를생성
create TRIGGER salary_audit
AFTER update on EMPLOYEE
for EACH row
begin
    # 급여 변경되었는지 확인
    if old.salary <> new.salary then
        # 급여 변경사항을 salary_audit 테이블에 기록
        insert salary_audit (ssn, before_salary, after_salary, u_datetime)
        values (new.Ssn, old.salary, new.salary, now());
    end if;
end;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [53]:
%sql select * from salary_audit;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
0 rows affected.

[]

In [54]:
%sql update EMPLOYEE set salary = 2 * salary where dno = 5;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
4 rows affected.

[]

In [55]:
%sql select * from salary_audit;

 * mysql://s202000449:***@dm.hufs.ac.kr:3306/s202000449db
8 rows affected.

[('123456789', Decimal('36300.00'), Decimal('72600.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('123456789', Decimal('36300.00'), Decimal('72600.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('333445555', Decimal('44000.00'), Decimal('88000.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('333445555', Decimal('44000.00'), Decimal('88000.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('453453453', Decimal('30250.00'), Decimal('60500.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('453453453', Decimal('30250.00'), Decimal('60500.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('666884444', Decimal('41800.00'), Decimal('83600.00'), datetime.datetime(2023, 11, 30, 4, 21, 57)),
 ('666884444', Decimal('41800.00'), Decimal('83600.00'), datetime.datetime(2023, 11, 30, 4, 21, 57))]